      ******************************************************************
      * Author: Adriano Teles
      * Date: 03/11/2016
      * Purpose: Calculate payroll
      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FOLHA-DE-PAGAMENTO.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-MAIUSCULAS PIC X(026) VALUE 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'.
       01  WS-MINUSCULAS PIC X(026) VALUE 'abcdefghijklmnopqrstuvwxyz'.
       01 COLABORADOR.
           02 WS-NOME PIC A(50).
           02 WS-MAT PIC 9(5).
           02 WS-CPF PIC 9(11).
           02 WS-RG PIC 9(8).
           02 WS-CARGO PIC A(50).
           02 WS-CH PIC 9(3).
           02 WS-SALBA PIC 9(6).
           02 WS-SALIQ PIC 9(6).
           02 WS-SALBR PIC 9(6).
           02 WS-HE PIC 9(2).
           02 WS-TOTAL-HE PIC 9(6).
           02 WS-INSS PIC 9(6).
           02 WS-IRRF PIC 9(6).
           02 WS-DEP PIC 9(2).
           02 WS-TOTAL-DEP PIC 9(6).
           02 ADMISSAO.
               03 WS-DIA PIC 9(2).
               03 WS-MES PIC 9(2).
               03 WS-ANO PIC 9(4).
       PROCEDURE DIVISION.
           DISPLAY '____________________________________________________
      -'____________________' AT 0203.
           DISPLAY "COLABORADOR" AT 0333.
           DISPLAY "NOME:" AT 0426.
           DISPLAY "MATRICULA:" AT 0405.
           DISPLAY "CARGO:" AT 0505.
           DISPLAY "ADMISSAO:" AT 0605.
           DISPLAY "CPF:" AT 0630.
           DISPLAY "RG:" AT 0651.
           DISPLAY '____________________________________________________
      -'____________________' AT 0703.
           DISPLAY 'BASE DE CALCULO' AT 0831.
           DISPLAY "SALARIO BASE:" AT 0905.
           DISPLAY "CARGA HORARIA:" AT 0935.
           DISPLAY "HORAS EXTRAS:" AT 0958.
           DISPLAY "DEPENDENTES:" AT 1005.
           DISPLAY '____________________________________________________
      -'____________________' AT 1103.
       DISPLAY "PROVENTOS" AT 1217.
           DISPLAY "SALARIO BRUTO: R$" AT 3005
           DISPLAY "|" AT 1438.
           DISPLAY "|" AT 1538.
           DISPLAY "|" AT 1638.
           DISPLAY "|" AT 1738.
           DISPLAY "|" AT 1838.
           DISPLAY "|" AT 1938.
           DISPLAY "|" AT 2038.
           DISPLAY "|" AT 2138.
           DISPLAY "|" AT 2238.
           DISPLAY "|" AT 2338.
           DISPLAY "|" AT 2438.
           DISPLAY "|" AT 2538.
           DISPLAY "|" AT 2638.
           DISPLAY "|" AT 2738.
           DISPLAY "|" AT 2838.
           DISPLAY "DESCONTOS" AT 1253
           DISPLAY "SALARIO LIQUIDO: R$" AT 3045.
           ACCEPT WS-MAT AT 0416 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-NOME AT 0432 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           INSPECT WS-NOME CONVERTING WS-MINUSCULAS TO WS-MAIUSCULAS.
           DISPLAY WS-NOME AT 0432 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-CARGO AT 0512 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           INSPECT WS-CARGO CONVERTING WS-MINUSCULAS TO WS-MAIUSCULAS.
           DISPLAY WS-CARGO AT 0512 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           DISPLAY WS-DIA AT 0615 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           DISPLAY "/" AT 0617 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           DISPLAY WS-MES AT 0618 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           DISPLAY "/" AT 0620 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           DISPLAY WS-ANO AT 0621 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-DIA AT 0615 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-MES AT 0618 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-ANO AT 0621 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-CPF AT 0635 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-RG AT 0655 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           DISPLAY "R$ " AT 0919 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-SALBA AT 0922 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-CH AT 0950 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-HE AT 0972 WITH HIGHLIGHT FOREGROUND-COLOR 03.
           ACCEPT WS-DEP AT 1018 WITH HIGHLIGHT FOREGROUND-COLOR 03.

           COMPUTE WS-TOTAL-HE = ( (WS-SALBA / WS-CH) + (WS-SALBA / WS-C
      -H) * 50 / 100 ) * WS-HE.
           COMPUTE WS-SALBR = WS-SALBA + WS-TOTAL-HE.
           COMPUTE WS-TOTAL-DEP = WS-DEP * 189.59.

           IF (WS-SALBR > 0) AND (WS-SALBR <= 1556.94)
               COMPUTE WS-INSS = WS-SALBR * 0.08
           ELSE IF (WS-SALBR > 1556.94) AND (WS-SALBR <= 2594.92)
               COMPUTE WS-INSS = WS-SALBR * 0.09
           ELSE IF (WS-SALBR > 2594.92) AND (WS-SALBR <= 5189.82)
               COMPUTE WS-INSS = WS-SALBR * 0.11
           ELSE IF (WS-SALBR > 5189.82)
               COMPUTE WS-INSS = 5189.82 * 0.11
           ELSE
               COMPUTE WS-INSS = 0
           END-IF.


           IF ((WS-SALBR - WS-INSS) - WS-TOTAL-DEP > 1903.98) AND
      -(((WS-SALBR - WS-INSS) - WS-TOTAL-DEP) <= 2826.65)
               COMPUTE WS-IRRF = (((WS-SALBR - WS-INSS) - WS-TOTAL-DEP)
      - * 0.075) - 142.80
           ELSE IF (((WS-SALBR - WS-INSS) - WS-TOTAL-DEP) > 2826.65
      -) AND (((WS-SALBR - WS-INSS) - (WS-DEP * 189.59)) <= 3751.05)
               COMPUTE WS-IRRF = (((WS-SALBR - WS-INSS) - WS-TOTAL-DEP)
      - * 0.150) - 354.80
           ELSE IF (((WS-SALBR - WS-INSS) - WS-TOTAL-DEP) > 3751.05
      -) AND (((WS-SALBR - WS-INSS) - WS-TOTAL-DEP) <= 4664.68)
               COMPUTE WS-IRRF = (((WS-SALBR - WS-INSS) - WS-TOTAL-DEP)
      - * 0.225) - 636.13
           ELSE IF (((WS-SALBR - WS-INSS) - WS-TOTAL-DEP) > 4664.68)
               COMPUTE WS-IRRF = (((WS-SALBR - WS-INSS) - WS-TOTAL-DEP)
      - * 0.275) - 869.36
           ELSE
               COMPUTE WS-IRRF = 0
           END-IF.
           DISPLAY "IRRF: R$" AT 1443 WITH HIGHLIGHT FOREGROUND-COLOR 4.
           DISPLAY WS-IRRF AT 1452 WITH HIGHLIGHT FOREGROUND-COLOR 4.
           DISPLAY "SALARIO BASE: R$" AT 1405 WITH HIGHLIGHT FOREGROUND-
      -COLOR 2.
           DISPLAY WS-SALBA AT 1422 WITH HIGHLIGHT FOREGROUND-COLOR 2.
           DISPLAY "HE: R$" AT 1505 WITH HIGHLIGHT FOREGROUND-COLOR 2.
           DISPLAY WS-TOTAL-HE AT 1512 WITH HIGHLIGHT FOREGROUND-COLOR 2
           DISPLAY WS-SALBR AT 3023.
           DISPLAY "INSS: R$" AT 1443 WITH HIGHLIGHT FOREGROUND-COLOR 4.
           DISPLAY WS-INSS AT 1452 WITH HIGHLIGHT FOREGROUND-COLOR 4.
           DISPLAY "IRRF: R$" AT 1543 WITH HIGHLIGHT FOREGROUND-COLOR 4.
           DISPLAY WS-IRRF AT 1552 WITH HIGHLIGHT FOREGROUND-COLOR 4.

           COMPUTE WS-SALIQ = WS-SALBR - WS-INSS - WS-IRRF.
           DISPLAY WS-SALIQ AT 3065.
            STOP RUN.
       END PROGRAM FOLHA-DE-PAGAMENTO.
